ОписаниеИзмененийСистемы/src/ExternalDataProcessors/ОписаниеИзмененийСистемы/ОписаниеИзмененийСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>ОписаниеИзмененийСистемы</name>
  <attributes>
    <name>ЗадачиРелиза</name>
    <type>
      <types>SpreadsheetDocument</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРелиза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияРелиза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоследнийНомерРелиза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРелиза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеИзмененийСистемы</name>
    <type>
      <types>SpreadsheetDocument</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>apiKey</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРелизаВТелеграм</name>
    <type>
      <types>TextDocument</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийКаталог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЧейнджлог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:ExternalDataProcessor>

ОписаниеИзмененийСистемы/src/ExternalDataProcessors/ОписаниеИзмененийСистемы/Forms/Форма/Module.bsl
&НаКлиенте
Функция ПрочитатьДанныеИзФайлаJSON(ИмяФайла)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл(ИмяФайла, "UTF-8");
	Данные = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	Возврат Данные;
КонецФункции

&НаКлиенте
Процедура КомандаПечать(Команда)
	КодВозврата = 0;
	ПутьКФайлуНастроек = Объект.РабочийКаталог + "\settings.json";
	СтрокаЗапуска = СтрШаблон("make-release-data.bat -p %1 -t %2 -s %3", Объект.Пароль, Объект.apiKey, ПутьКФайлуНастроек);
	ЗапуститьПриложение(СтрокаЗапуска, Объект.РабочийКаталог, Истина, КодВозврата);
	Если КодВозврата <> 0 Тогда
		Сообщить("Ошибка выгрузки данных релиза!");
		Сообщить(СтрШаблон("Ошибка: %1: %2", КодВозврата, СтрокаЗапуска));
		Возврат;
	КонецЕсли;
	Настройки = ПрочитатьДанныеИзФайлаJSON(Объект.РабочийКаталог + "\settings.json");
	Данные = ПрочитатьДанныеИзФайлаJSON(Объект.РабочийКаталог + "\release-data.json");
	СформироватьОтчет(Данные, Настройки);
	Печать(Объект.ЗадачиРелиза, СтрШаблон("Релиз ЕФС %1", СтрЗаменить(Объект.ВерсияРелиза, ".", "_")));
КонецПроцедуры

// Вывести заголовок.
// 
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент - Табличный документ
//  Заголовок - Строка - Заголовок
&НаСервере
Процедура ВывестиЗаголовок(ТабличныйДокумент, Заголовок)
	Секция = ТабличныйДокумент.ПолучитьОбласть("R1");
	Секция.Область("R1C1").Текст = Заголовок;
	ТабличныйДокумент.Вывести(Секция);
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет(Данные, Настройки)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СформироватьОписаниеРелиза(Данные, Настройки);
	ОбработкаОбъект.СформироватьОтчет(Данные, Настройки);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура Печать(ТабличныйДокумент, Заголовок)
	ИдентификаторПечатнойФормы = ОбщийКлиентСервер.ИмяПоУникальномуИдентификатору();
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = Заголовок;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = Заголовок;
	ПечатнаяФорма.ТабличныйДокумент = ТабличныйДокумент;
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Новый СписокЗначений, Новый Структура("ЗаголовокФормы", Заголовок));
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзмененияМетаданных(Команда)
	Настройки = ПрочитатьДанныеИзФайлаJSON(Объект.РабочийКаталог + "\settings.json");
	Данные = ПрочитатьДанныеИзФайлаJSON(Объект.РабочийКаталог + "\release-data.json");
	КомандаИзмененияМетаданныхНаСервере(Данные, Настройки);
КонецПроцедуры

&НаСервере
Процедура КомандаИзмененияМетаданныхНаСервере(Данные, Настройки)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СформироватьОтчетПоМетаданным(Данные, Настройки);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура КомандаМакет(Команда)
	КомандаМакетНаСервере();
КонецПроцедуры

&НаСервере
Функция ТекстВОбласть(Элемент, Параметры) Экспорт
	ИмяОбласти = Лев(Элемент, 2);
	Если Параметры.Области.Найти(ИмяОбласти) <> Неопределено Тогда
		Область = Параметры.ПолучитьОбласть(ИмяОбласти);
		Область.Параметры.Текст = Прав(Элемент, СтрДлина(Элемент) - 4);
	Иначе
		Область = Параметры.ПолучитьОбласть("Строка");
		Область.Параметры.Текст = Элемент;
	КонецЕсли;
	Возврат Область;
КонецФункции

&НаСервере
Процедура ОчиститьОбласти(ТабличныйДокумент)
	Области = ТабличныйДокумент.Области;
	Колво = Области.Количество();
	Для й = 1 По Колво Цикл
		Области[Колво - й].Имя = "";
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура КомандаМакетНаСервере()
	// Вставить содержимое обработчика.
	ТабличныйДокумент = Объект.ОписаниеИзмененийСистемы;
	ТабличныйДокумент.Очистить();
	_Обработка = РеквизитФормыВЗначение("Объект");
	МакетОписания = _Обработка.ПолучитьМакет("Макет");
	Макет = _Обработка.ПолучитьМакет("ОписаниеИзмененийСистемы");
	Текст = МакетОписания.ПолучитьТекст();
	РаботаСМассивом.АТДМассив(СтрРазделить(Текст, Символы.ВК+Символы.ПС, Ложь))
		.Отобрать("НЕ ПустаяСтрока(Элемент)")
		.Отобразить("Контекст.ТекстВОбласть(Элемент, Параметры)", ЭтотОбъект, Макет)
		.Положить(Макет.ПолучитьОбласть("Разделитель"))
		.ДляКаждого("Контекст.Вывести(Элемент)", ТабличныйДокумент)
	;
	ОчиститьОбласти(ТабличныйДокумент);
	ВерсияРелиза = "3.0.2.18";
	ТабличныйДокумент.Область(1, , 1, ).Имя = СтрШаблон("Шапка%1", СтрЗаменить(ВерсияРелиза, ".", "_"));
	ТабличныйДокумент.Область(2, , ТабличныйДокумент.ВысотаТаблицы, ).Имя = СтрШаблон("Версия%1", СтрЗаменить(ВерсияРелиза, ".", "_"));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ФайлОбработки = Новый Файл(ЭтотОбъект.ИспользуемоеИмяФайла);
	//ТекущийКаталог = ФайлОбработки.Путь;
КонецПроцедуры


&НаКлиенте
Процедура АдресВнешнейСсылкиНажатие(Элемент)
	ЗапуститьПриложение("https://jira.pik.ru/projects/EFS?selectedItem=com.atlassian.jira.jira-projects-plugin%3Arelease-page&status=released-unreleased");
КонецПроцедуры

&НаКлиенте
Процедура АдресКаналаТелеграмНажатие(Элемент)
	ЗапуститьПриложение("https://t.me/markdownbot");
КонецПроцедуры
